package com.javarush.task.task04.task0418;
import java.io.*;
import java.util.*;
public class Solution {
    public static void main(String[] args) throws Exception {
        //напишите тут ваш код

//
//         if (a < b){
//
//            System.out.println(a);
//        } else {
//            System.out.println(b);
        }

    }
//}
//    Ввести с клавиатуры два целых числа, и вывести на экран минимальное из них.
//        Если два числа равны между собой, необходимо вывести любое.
//        Требования:
//        •	Программа должна считывать числа c клавиатуры.
//        •	Программа должна выводить число на экран.
//        •	Программа должна выводить на экран минимальное из двух целых чисел.
//        •	Если два числа равны между собой, необходимо вывести любое.
