package com.javarush.task.task04.task0438;

public class Solution {
    public static void main(String[] args) {
        //напишите тут ваш код
        int d = 8;

        for (int j = 0; j < 10; j++){

            System.out.print(d);

        }
        System.out.println();

        for (int i = 0; i < 10; i++){

            System.out.println(d);
        }

    }
}

// 8888888888
// 8

//

//    Используя цикл for вывести на экран:
//        - горизонтальную линию из 10 восьмёрок
//        - вертикальную линию из 10 восьмёрок (символ из горизонтальной строки не учитывается).
//
//        Требования:
//        •	Программа не должна считывать числа c клавиатуры.
//        •	Программа должна выводить числа на экран.
//        •	Программа должна выводить горизонтальную линию из 10 восьмёрок.
//        •	Программа должна выводить вертикальную линию из 10 восьмёрок.
//        •	В программе должен использоваться цикл for.
