package com.javarush.task.task01.task0133;

public class Solution {
    public static void main(String[] args) {
        int secondsAfter15 = 1800;
        System.out.println(secondsAfter15);
    }
}
//    Напиши код, который считает сколько секунд прошло с 15:00, если на часах 15:30. Выведи результат на экран.
//        Требования:
//        Программа должна выводить текст.
//        Выведенный текст должен быть целым положительным числом.
//        Выведенное число должно быть кратно 60.
//        Выводимое число должно соответствовать заданию.
