package com.javarush.task.task04.task0439;

import java.util.Scanner;

public class Solution {
    public static void main(String[] args) throws Exception {
        //напишите тут ваш код
        Scanner scanner = new Scanner(System.in);
        String name = scanner.nextLine();

        String s = name + " любит меня.";

        for (int i = 0; i < 10; i++){
            System.out.println(s);
        }

    }

}


//    Ввести с клавиатуры имя и используя цикл for 10 раз вывести: <имя> любит меня.
//
//        Пример вывода на экран для имени Света:
//        Света любит меня.
//        Света любит меня.
//        Света любит меня.
//        Света любит меня.
//        Света любит меня.
//        Света любит меня.
//        Света любит меня.
//        Света любит меня.
//        Света любит меня.
//        Света любит меня.
//
//        Требования:
//        •	Программа должна считывать имя c клавиатуры.
//        •	Программа должна выводить текст на экран.
//        •	Программа должна выводить 10 раз текст указанный в задании.
//        •	В программе должен использоваться цикл for.