package com.javarush.task.task04.task0430;

public class Solution {
    public static void main(String[] args) {
        //напишите тут ваш код
        int i = 1;
        while (i <= 10)
        {
            System.out.println(i);
            i = i + 1;
        }

    }
}


//    Вывести на экран числа от 1 до 10 используя цикл while. Каждое значение с новой строки.
//
//        Требования:
//        •	Программа не должна считывать числа c клавиатуры.
//        •	Программа должна выводить числа на экран.
//        •	Каждое значение должно быть выведено с новой строки.
//        •	Программа должна выводить числа от 1 до 10.
//        •	В программе должен использоваться цикл while.