package com.javarush.task.task03.task0324;

public class Solution {
    public static void main(String[] args) {
        //напишите тут ваш код
        for (int i = 0; i < 10; i = i + 1 ) {
         String s  = "Я хочу большую зарплату, и для этого изучаю Java";
            System.out.println(s);
        }
        //System.out.println(s);



    }
}
//    Вывести на экран десять раз надпись "Я хочу большую зарплату, и для этого изучаю Java"
//        Требования:
//        Программа не должна считывать данные с клавиатуры.
//        Программа должна выводить текст.
//        Текст должен начинаться с "Я хочу".
//        Текст должен заканчиваться на "изучаю Java".
//        Текст должен состоять из 10 строк.
//        Выводимый текст должен соответствовать заданию.
