package com.javarush.task.task03.task0308;

public class Solution {
    public static void main(String[] args) {
        //напишите тут ваш код
        System.out.println(1 * 2 * 3 * 4 * 5 * 6 * 7 * 8 * 9 * 10);


    }
}
//    Вывести на экран произведение 10 чисел от 1 до 10.
//        Результат - это 1 число.
//        Подсказка:
//        будет три миллиона с хвостиком.
//        Требования:
//        •	Программа должна выводить целое число на экран.
//        •	Метод main должен вызывать функцию System.out.println.
//        •	Выведенное число должно быть больше трех миллионов.
//        •	Выведенное число должно соответствовать заданию.