package com.javarush.task.task18.task1816;

import java.io.FileReader;
import java.io.IOException;
import java.util.Arrays;
import java.util.HashSet;
import java.util.Set;

public class Solution {
    public static void main(String[] args) {

      //  String fileName =



        for (String arg : args) {
            System.out.println(arg);
        }

    }
}

//    В метод main первым параметром приходит имя файла.
//        Посчитать количество букв английского алфавита, которое есть в этом файле.
//        Вывести на экран число (количество букв).
//        Закрыть потоки.
//
//        Требования:
//        •	Считывать с консоли ничего не нужно.
//        •	Создай поток чтения из файла, который приходит первым параметром в main.
//        •	В файле необходимо посчитать буквы английского алфавита и вывести это число в консоль.
//        •	Нужно учитывать заглавные и строчные буквы.
//        •	Поток чтения из файла должен быть закрыт.
